load_test.yml
config:
  target: 'http://localhost:8010'
  phases:
    - duration: 30
      arrivalRate: 100
scenarios:
  - name: "Riders"
    flow:
      - post:
          url: "/rides"
          json:
            start_lat: 0
            start_long: 0
            end_lat: 0
            end_long: 0
            rider_name: "Name"
            driver_name: "Name"
            driver_vehicle: "Name"
          capture:
            json: "$[0].rideID"
            as: "id"
      - get:
          url: "/rides/{{ id }}"
      - get:
          url: "/rides"
          qs:
            page: 1